import React from 'react'
import ReactMarkdown from 'react-markdown'
import { Prism as SyntaxHighlighter } from 'react-syntax-highlighter'
import { vs } from 'react-syntax-highlighter/dist/esm/styles/prism'
import remarkMath from 'remark-math'
import rehypeKatex from 'rehype-katex'
import 'katex/dist/katex.min.css' // `rehype-katex` does not import the CSS for you
import { Scatter } from 'react-chartjs-2'

import Markdown from '../../components/Markdown'

const data = {
  datasets: [
    {
      label: 'BM_BubbleSortAsc',
      data: [
        { x: 8, y: 0.28931588822904497 },
        { x: 16, y: 0.37215892833287134 },
        { x: 32, y: 0.6992472774687621 },
        { x: 64, y: 1.866804630401268 },
        { x: 128, y: 6.340108354774167 },
        { x: 256, y: 23.882599693194432 },
        { x: 512, y: 93.34326810826563 },
        { x: 1024, y: 369.4586335272473 },
        { x: 2048, y: 1485.5935074309577 },
        { x: 4096, y: 5875.853605042101 },
        { x: 8192, y: 23491.380533333424 },
        { x: 16384, y: 92945.04542857142 },
        { x: 32768, y: 373812.7594999998 },
      ],
      backgroundColor: 'rgba(255, 99, 132)',
      borderColor: 'rgba(255, 99, 132, 0.2)',
      showLine: true,
    },
    {
      label: 'BM_BubbleSortDesc',
      data: [
        { x: 8, y: 0.28827375495690516 },
        { x: 16, y: 0.3320854304470427 },
        { x: 32, y: 0.5601463619067455 },
        { x: 64, y: 1.5201651139181447 },
        { x: 128, y: 5.896427223856983 },
        { x: 256, y: 26.124897308594075 },
        { x: 512, y: 110.85082120251657 },
        { x: 1024, y: 456.6675778502313 },
        { x: 2048, y: 1849.116053333347 },
        { x: 4096, y: 7468.121170212896 },
        { x: 8192, y: 30030.158260869684 },
        { x: 16384, y: 120727.28616666712 },
        { x: 32768, y: 482607.16699999763 },
      ],
      backgroundColor: 'rgba(54, 162, 235)',
      borderColor: 'rgba(54, 162, 235, 0.2)',
      showLine: true,
    },
    {
      label: 'BM_BubbleSortRandom',
      data: [
        { x: 8, y: 0.3397984178365679 },
        { x: 16, y: 0.5570621646576436 },
        { x: 32, y: 1.2860527534745603 },
        { x: 64, y: 3.8845156591782914 },
        { x: 128, y: 13.201557994501393 },
        { x: 256, y: 42.085980531624784 },
        { x: 512, y: 140.34673096941665 },
        { x: 1024, y: 504.51617268799055 },
        { x: 2048, y: 1975.9384378530747 },
        { x: 4096, y: 9189.690727272258 },
        { x: 8192, y: 46755.86793333319 },
        { x: 16384, y: 220406.7620000032 },
        { x: 32768, y: 956759.9030000054 },
      ],
      backgroundColor: 'rgba(255, 206, 86)',
      borderColor: 'rgba(255, 206, 86, 0.2)',
      showLine: true,
    },
  ],
  options: {
    responsive: true,
  },
}

const data2 = {
  datasets: [
    {
      label: 'BM_BubbleSortRandom',
      data: [
        { x: 8, y: 0.3397984178365679 },
        { x: 16, y: 0.5570621646576436 },
        { x: 32, y: 1.2860527534745603 },
        { x: 64, y: 3.8845156591782914 },
        { x: 128, y: 13.201557994501393 },
        { x: 256, y: 42.085980531624784 },
        { x: 512, y: 140.34673096941665 },
        { x: 1024, y: 504.51617268799055 },
        { x: 2048, y: 1975.9384378530747 },
        { x: 4096, y: 9189.690727272258 },
        { x: 8192, y: 46755.86793333319 },
        { x: 16384, y: 220406.7620000032 },
        { x: 32768, y: 956759.9030000054 },
      ],
      backgroundColor: 'rgba(255, 206, 86)',
      borderColor: 'rgba(255, 206, 86, 0.2)',
      showLine: true,
    },
    {
      label: 'BM_BubbleSort2Random',
      data: [
        { x: 8, y: 0.3404872026359434 },
        { x: 16, y: 0.5578101409799994 },
        { x: 32, y: 1.2849032783984196 },
        { x: 64, y: 3.878451352701232 },
        { x: 128, y: 13.129458697320322 },
        { x: 256, y: 41.99057520167057 },
        { x: 512, y: 140.14439396991654 },
        { x: 1024, y: 503.04871684597515 },
        { x: 2048, y: 1972.9789185392056 },
        { x: 4096, y: 9133.877220779252 },
        { x: 8192, y: 46391.51686666452 },
        { x: 16384, y: 218948.17699999906 },
        { x: 32768, y: 951574.9569999983 },
      ],
      backgroundColor: 'rgba(75, 192, 192)',
      borderColor: 'rgba(75, 192, 192, 0.2)',
      showLine: true,
    },
  ],
  options: {
    responsive: true,
  },
}

const data3 = {
  datasets: [
    {
      label: 'BM_BubbleSort3Asc',
      data: [
        { x: 8, y: 0.27968772208420933 },
        { x: 16, y: 0.2840911645022689 },
        { x: 32, y: 0.29322532292299774 },
        { x: 64, y: 0.3175725176982131 },
        { x: 128, y: 0.35452086676670036 },
        { x: 256, y: 0.42757679992310665 },
        { x: 512, y: 0.5768073739353871 },
        { x: 1024, y: 0.868910100552665 },
        { x: 2048, y: 1.4569089704834832 },
        { x: 4096, y: 2.628200777076759 },
        { x: 8192, y: 5.008832010706706 },
        { x: 16384, y: 9.700951952944981 },
        { x: 32768, y: 19.136374244966085 },
      ],
      backgroundColor: 'rgba(255, 99, 132)',
      borderColor: 'rgba(255, 99, 132, 0.2)',
      showLine: true,
    },
    {
      label: 'BM_BubbleSort3Desc',
      data: [
        { x: 8, y: 0.2923720783471963 },
        { x: 16, y: 0.33835293763436747 },
        { x: 32, y: 0.5435075286672755 },
        { x: 64, y: 1.502653325955908 },
        { x: 128, y: 5.936425194479698 },
        { x: 256, y: 26.46183385080209 },
        { x: 512, y: 111.60257253478332 },
        { x: 1024, y: 458.991377530979 },
        { x: 2048, y: 1858.4204456232685 },
        { x: 4096, y: 7495.18324468099 },
        { x: 8192, y: 30072.143913044343 },
        { x: 16384, y: 120252.80400000089 },
        { x: 32768, y: 483250.2170000019 },
      ],
      backgroundColor: 'rgba(54, 162, 235)',
      borderColor: 'rgba(54, 162, 235, 0.2)',
      showLine: true,
    },
    {
      label: 'BM_BubbleSort3Random',
      data: [
        { x: 8, y: 0.3340508963849674 },
        { x: 16, y: 0.5549773634739321 },
        { x: 32, y: 1.2561793158036525 },
        { x: 64, y: 3.6372669859986417 },
        { x: 128, y: 11.854763528596541 },
        { x: 256, y: 37.19890781986734 },
        { x: 512, y: 123.6369039757932 },
        { x: 1024, y: 445.05371809522774 },
        { x: 2048, y: 1766.2478992443478 },
        { x: 4096, y: 8618.306197530712 },
        { x: 8192, y: 46449.391533333066 },
        { x: 16384, y: 219019.00466666528 },
        { x: 32768, y: 955852.3319999991 },
      ],
      backgroundColor: 'rgba(255, 206, 86)',
      borderColor: 'rgba(255, 206, 86, 0.2)',
      showLine: true,
    },
    {
      label: 'BM_BubbleSort2Random',
      data: [
        { x: 8, y: 0.3404872026359434 },
        { x: 16, y: 0.5578101409799994 },
        { x: 32, y: 1.2849032783984196 },
        { x: 64, y: 3.878451352701232 },
        { x: 128, y: 13.129458697320322 },
        { x: 256, y: 41.99057520167057 },
        { x: 512, y: 140.14439396991654 },
        { x: 1024, y: 503.04871684597515 },
        { x: 2048, y: 1972.9789185392056 },
        { x: 4096, y: 9133.877220779252 },
        { x: 8192, y: 46391.51686666452 },
        { x: 16384, y: 218948.17699999906 },
        { x: 32768, y: 951574.9569999983 },
      ],
      backgroundColor: 'rgba(75, 192, 192)',
      borderColor: 'rgba(75, 192, 192, 0.2)',
      showLine: true,
    },
  ],
  options: {
    responsive: true,
  },
}
function BubbleSort() {
  return (
    <>
      <h2>Bubble Sort</h2>
      <div>
        <Markdown>{`
簡単に理解できるということでよく最初に習うソート。

気持ちとしては、順序が前後しているところを入れ替えるという操作を、そういったところがなくなるまで続ければ全体がソートされるよねということ。

順序が前後しているところを配列の前から順に探すと、結果として一番大きな要素が一番後ろに移動する。（逆に後ろからみていくと、一番小さな要素が先頭に移動する。）

1. 最初の２つの要素を比較して、順序がおかしければ（前の方が後ろのものより大きければ）入れ替える。
1. 次に、一つ後ろに移動してこれを繰り返す。つまり、2番目と3番目の要素に対して、1の操作を行う。これを一つずつ後ろに移動しながら、一番、最後まで続ける。
1. 最後までたどり着いたら、1へ戻る。ただし、最後の要素はすでに最大のものになっているので、その一つ前で終了する。

最悪ケースの計算量は $O(n^2)$ 。

安定ソートであり、並列化も考えやすい。

~~~c++
void bubble_sort(int *arr, int n) {
  for (int i = 0; i < n - 1; ++i) {
      for (int j = 1; j < n - i; --j) {
          if (arr[j - 1] > arr[j]) {
              int tmp = arr[j];
              arr[j] = arr[j - 1];
              arr[j - 1] = tmp;
          }
      }
  }
}
~~~
        `}</Markdown>
        <Scatter data={data} />
        <Markdown>{`
- BM_BuubleSortASCは1, 2, 3, ..., nの最初からソートされている数列、
- BM_BubbleSortDescは逆にn, n-1, ..., 2, 1の逆順の数列、
- BM_BubbleSortRandomは完全にランダムな数列である。


### 後ろから前へ

上記のプロうグラムで前から後ろへとfor-loopを回しているが、後ろから前へとしても同じである。

つまり、

1. 最後の２つの要素を比較して、順序がおかしければ（前の方が後ろのものより大きければ）入れ替える。
1. 次に、一つ前に移動してこれを繰り返す。つまり、最後から2番目と3番目の要素に対して、1の操作を行う。これを一つずつ前に移動しながら、一番、先頭まで続ける。
1. 先頭までたどり着いたら、1へ戻る。ただし、先頭の要素はすでに最大のものになっているので、その一つ前で終了する。

~~~c++
void bubble_sort2(int *arr, int n) {
  for (int i = 0; i < n - 1; ++i) {
      for (int j = n - 1; j > i; --j) {
          if (arr[j - 1] > arr[j]) {
              int tmp = arr[j];
              arr[j] = arr[j - 1];
              arr[j - 1] = tmp;
          }
      }
  }
}
~~~

こうすると、ループの終了判定の条件式が j < n - i から j > i に変わる。僅かな差であるが、n - i の計算がなくなる分、このbubble_sort2の方が速くなる。
        `}</Markdown>
        <Scatter data={data2} />

        <Markdown>{`
### ソート済み判定

bubble sortは揃っていない部分を必ず入れ替えるので、売り側のループで一度も入れ替えが起きなかったときは全体がソートされたということであり、処理を終えてよい。

~~~c++
void bubble_sort3(int *arr, int n) {
  for (int i = 0; i < n - 1; ++i) {
      bool no_swap = true;
      for (int j = n - 1; j > i; --j) {
          if (arr[j - 1] > arr[j]) {
              int tmp = arr[j];
              arr[j] = arr[j - 1];
              arr[j - 1] = tmp;
              no_swap = false;
          }
      }
      if (no_swap) {
          // if no swap happens, we can stop.
          return;
      }
  }
}
~~~

もとから整列している数列に対しては、1度の数列のスキャンで処理が終わる。

しかし、このソート済み判定のための処理がループ内に増えるために、ランダムな数列のときはわずかに遅くなる。
        `}</Markdown>
        <Scatter data={data3} />
      </div>
    </>
  )
}

export default BubbleSort
